&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив) Экспорт
	// Выбираем коэффициент пересчёта
	ЗначениеОтбора = Новый Структура("НаборСвойств", "Справочник ""Номенклатура"" (Общие)");
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ФормаВыбораДопПараметра = ПолучитьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаВыбора");
	ДопРеквизит = ФормаВыбораДопПараметра.ОткрытьМодально();
	Если Не ЗначениеЗаполнено(ДопРеквизит) Тогда
		Возврат;
	КонецЕсли;
	
	// Выбираем вид цены
	ФормаВыбораВидаЦен = ПолучитьФорму("Справочник.ВидыЦен.ФормаВыбора");
	ВидЦены = ФормаВыбораВидаЦен.ОткрытьМодально();
	Если Не ЗначениеЗаполнено(ВидЦены) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполняем таблицу цены выбранного вида
	Для Каждого ТекущаяСтрока из ВладелецФормы.Объект.Товары Цикл
		Если ТекущаяСтрока.ВидЦены = ВидЦены Тогда
			ТекущаяЦена = ТекущаяСтрока.Цена;
			ТекущаяСтрока.Цена = НайтиЦену(ДопРеквизит, ТекущаяСтрока.Номенклатура, ТекущаяСтрока.Цена);
			Если ТекущаяЦена <> ТекущаяСтрока.Цена Тогда
				Процент = Окр((ТекущаяСтрока.Цена - ТекущаяЦена) * 100 / ТекущаяЦена, 1);
				Сообщить(Строка(ТекущаяСтрока.Номенклатура) + """ - цена изменилась " + Строка(ТекущаяЦена) + " -> " + Строка(ТекущаяСтрока.Цена) + " (" + Строка(Процент) + "%)");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Записываем документ и обновляем форму
	ВладелецФормы.Записать();
	ВладелецФормы.Прочитать();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеНаСервере()
	Возврат Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоНаименованию("Справочник ""Номенклатура"" (Общие)");
КонецФункции

&НаСервере
Функция НайтиЦену(ДопРеквизит, Номенклатура, Цена)
	Для Каждого Реквизит Из Номенклатура.ДополнительныеРеквизиты Цикл
		Если Реквизит.Свойство = ДопРеквизит И Реквизит.Значение <> 0 Тогда
			Если Реквизит.Значение < 0 Тогда
				Возврат Цена / (0 - Реквизит.Значение);
			Иначе
				Возврат Цена * Реквизит.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	// если ничего не нашли
	Возврат Цена;
КонецФункции
