
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Соединение = ПолучитьПодключениеКФайловойБД();
	Если Соединение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Соединение.NewObject("Запрос", ТекстЗапроса);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	РезультатЗапроса.Очистить();
	РезультатЗапроса.Колонки.Очистить();
	Для Каждого Колонка Из ТЗ.Columns Цикл
		РезультатЗапроса.Колонки.Добавить(Колонка.Title);
	КонецЦикла;
	ЭлементыФормы.РезультатЗапроса.СоздатьКолонки();
	Для Каждого Строка Из ТЗ Цикл
		Стр = РезультатЗапроса.Добавить();
		Ин = 0;
		Для Каждого Колонка Из ТЗ.Columns Цикл
			Стр.Установить(Ин, Строка.Get(Ин));
			Ин = Ин + 1;
		КонецЦикла;
	КонецЦикла;
	Сообщить("Запрос выполнен");
	
КонецПроцедуры

Функция ПолучитьПодключениеКФайловойБД()
	
	Параметры = СтрокаПодключения;
	V83COMConnector = Новый COMОбъект("V83.COMConnector");
	Попытка
		Возврат V83COMConnector.Connect(Параметры);
	Исключение
		Предупреждение ("Ошибка подключения: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;

КонецФункции
